<template>
  <div class="desk_why max-w-3xl m-auto text-lg">
    <h2 class="h2 my-20">{{ $t('header.why') }}</h2>

    <div class="lang--bg_only">
      <p>
        Представяме ви идеалния стол, който ще промени представата ви за комфорт и стил!
      </p>

      <p>
        Търсите стол, който ще ви радва всеки ден и ще подчертае вашия индивидуален стил? Тогава SimplyTheDesk е точно това, което ви трябва! Този стол не е просто работна повърхност, той е мястото, което ще стане вашето вдъхновение, вашата точка на концентрация и уют в едно.
      </p>

      <h3>Защо е толкова специален?</h3>

      <p>
        Защото съдържа всичко, което е необходимо за вашия комфорт и продуктивност:
      </p>

      <ul>
        <li>
          <h4>Премиум материали:</h4>

          <p>
            Всеки стол е изработен от внимателно подбрани материали, които не само че радват окото, но и служат дълги години.
          </p>
        </li>

        <li>
          <h4>Иновационна функционалност:</h4>

          <p>
            Вградените добре обмислени детайли, които правят работата ви по-лесна:
          </p>
        </li>

        <li>
          <h4>Развита система за кабели и зареждане</h4>

          <p>
            — никакви излишни кабели! Всичко е скрито в специален отсек, за да можете да се наслаждавате на чистотата и подредеността на работното си място.
          </p>
        </li>

        <li>
          <h4>Пасивна система за охлаждане:</h4>

          <p>
            Тя ще подобри комфорта и ще удължи живота на вашето оборудване, предотвратявайки прегряване и осигурявайки стабилна работа в продължение на дълги часове.
          </p>
        </li>

        <li>
          <h4>Регулируема височина</h4>

          <p>
            — столът се приспособява към вас. Работете прави или седнали — изберете най-удобното положение за максимална продуктивност.
          </p>
        </li>

        <li>
          <h4>Естетика и стил:</h4>
          <p>
            Този стол не е просто работна повърхност, той е истинско украшение за интериора ви. Съвременен минимализъм в съчетание с луксозни материали — идеален както за дома, така и за офиса. Той ще ви вдъхновява и вас, и вашите колеги!
          </p>
        </li>

        <li>
          <h4>Индивидуален подход:</h4>

          <p>
            Разбираме, че всеки човек е уникален, затова предлагаме възможност за създаване на стол по ваш индивидуален проект. Можете да изберете цвят, размер, форма и допълнителни функции. Това е стол, който ще се приспособи към вас и вашата работа!
          </p>
        </li>
      </ul>

      <h3>Защо точно този стол трябва да бъде ваш?</h3>

      <p>
        Това е пространство за творчество, продуктивност и комфорт. Столът, който става важна част от вашия ден.
      </p>

      <h3>Всеки стол е уникален.</h3>

      <p>
        Това не е масово производство — всеки стол се създава с любов и внимание към детайлите.
      </p>

      <h3>Качество и дълготрайност.</h3>

      <p>
        Получавате стол, който ще ви служи много години и няма да загуби привлекателността си.
      </p>

<p>
        Ако търсите не просто стол, а партньор в живота и работата, който ще ви вдъхновява и подкрепя, то SimplyTheDesk е вашият избор!
      </p>
    </div>

    <div class="lang--en_only">
      <p>
        Introducing the perfect desk that will change your perception of comfort and style!
      </p>

      <p>
        Looking for a desk that will delight you every day and highlight your unique style? Then SimplyTheDesk is exactly what you need! This desk is not just a workspace; it’s a place that will become your inspiration, your focus point, and your comfort all in one.
      </p>

      <h3>Why is it so special?</h3>

      <p>
        Because it has everything you need for your comfort and productivity:
      </p>

      <ul>
        <li>
          <h4>Premium materials:</h4>

          <p>
            Each desk is made from carefully selected materials that not only please the eye but also last for many years.
          </p>
        </li>

        <li>
          <h4>Innovative functionality:</h4>

          <p>
            Built-in thoughtful details that make your work easier:
          </p>
        </li>

        <li>
          <h4>Advanced cable and charging system</h4>

          <p>
            No more tangled wires and cables! Everything is hidden in a special compartment, so you can enjoy the cleanliness and order at your workstation.
          </p>
        </li>

        <li>
          <h4>Passive cooling system:</h4>

          <p>
            Helps improve comfort and extend the life of your equipment by preventing overheating and ensuring stable operation for long hours.
          </p>
        </li>

        <li>
          <h4>Adjustable height</h4>

          <p>
            The desk adapts to you. Work standing or sitting — choose the most comfortable position for maximum productivity.
          </p>
        </li>
      </ul>

      <h3>Aesthetics and style:</h3>

      <p>
        This desk is not just a workspace, but a true decoration for your interior. Modern minimalism combined with luxurious materials — it’s perfect for both home and office. It will inspire you and your colleagues!
      </p>
    </div>


    <div class="lang--ru_only">
      <p>
        Представляем вам идеальный стол, который изменит ваше представление о комфорте и стиле!
      </p>

      <p>
        В поисках стола, который будет радовать вас каждый день и подчеркивать ваш индивидуальный стиль? Тогда SimplyTheDesk — именно то, что вам нужно! Этот стол — не просто рабочая поверхность, это место, которое станет вашим вдохновением, вашей точкой сосредоточения и уютом в одном флаконе.
      </p>

      <h3>Почему он так особенный?</h3>

      <p>
        Потому что в нем есть все, что нужно для вашего комфорта и продуктивности:
      </p>

      <ul>
        <li>
          <h4>Премиальные материалы:</h4>

          <p>
            Каждый стол создается из тщательно отобранных материалов, которые не только радуют глаз, но и служат долгие годы. Высококачественная древесина, натуральные покрытия и износостойкие детали — все сделано так, чтобы стол оставался как новый, несмотря на активное использование.
          </p>
        </li>

        <li>
          <h4>Инновационный функционал:</h4>

          <p>
            Встроенные продуманные детали, которые делают вашу работу проще:
          </p>
        </li>

        <li>
          <h4>Продвинутая система проводов и зарядок</h4>

          <p>
            Никаких лишних проводов и кабелей! Все скрыто в специальном отсеке, чтобы вы могли наслаждаться чистотой и порядком на рабочем месте.
          </p>
        </li>

        <li>
          <h4>Регулируемая высота</h4>

          <p>
            Стол подстраивается под вас. Работайте стоя или сидя — выбирайте удобное положение для максимальной продуктивности.
          </p>
        </li>

        <li>
          <h4>Эстетика и стиль:</h4>

          <p>
            Этот стол станет не просто рабочей поверхностью, а настоящим украшением вашего интерьера. Современный минимализм в сочетании с роскошными материалами — идеально подходит как для дома, так и для офиса. Он будет вдохновлять вас и ваших коллег!
          </p>
        </li>
      </ul>

      <h3>Индивидуальный подход:</h3>

      <p>
        Мы понимаем, что каждый человек уникален, поэтому у нас есть возможность создания стола по вашему индивидуальному проекту. Вы можете выбрать цвет, размер, форму и дополнительные функции. Это стол, который подстроится под вас и вашу работу!
      </p>

      <h3>Почему именно этот стол должен быть у вас?</h3>

      <p>
        Он — не просто мебель. Это пространство для творчества, продуктивности и комфорта. Стол, который становится важной частью вашего дня.
      </p>

      <p>
        Каждый стол уникален. Это не массовое производство — каждый стол создается с любовью и вниманием к деталям.
      </p>

      <h3>Качество и долговечность.</h3>

      <p>
        Вы получаете стол, который будет служить вам много лет и не потеряет своей привлекательности.
      </p>

      <p>
        Если вы ищете не просто стол, а партнера по жизни и работе, который будет вдохновлять и поддерживать, то SimplyTheDesk — это ваш выбор!
      </p>
    </div>
  </div>
</template>

<script lang="ts" setup>
</script>

<style lang="scss" scoped>
@use "@/assets/css/_vars" as *;

.desk_why {
  padding: 0 1em;

  p {
    margin: 0 0 2em;
  }

  li {
    margin: 0 0 1em 2em;
    position: relative;

    &::before {
      background-color: $c_primary;
      border-radius: 50%;
      content: "";
      position: absolute;
      left: -1em;
      top: 0.5em;
      width: 0.5em;
      height: 0.5em;
      display: block;
    }
  }
}
</style>
